app/controllers/todos_controller.rb

UPDATE "todos" SET "description" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "fasdf"], ["updated_at", "2023-04-07 15:34:58.822895"], ["id", 3]]
---
    def update
        if @todo.update(todo_params)

INSERT INTO "todos" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "f"], ["description", "f"], ["created_at", "2023-04-06 19:09:50.094009"], ["updated_at", "2023-04-06 19:09:50.094009"]]
---
    def create
        if @todo.save